skybadger/ESP8266_AscomDome/ASCOM_DomeHandler.h
void handleCanSetParkGet(void)
{
    String message;
    uint32_t clientID = (uint32_t)server.arg("ClientID").toInt();
    uint32_t transID = (uint32_t)server.arg("ClientTransactionID").toInt();
    DynamicJsonBuffer jsonBuffer(256);
    JsonObject& root = jsonBuffer.createObject();
    jsonResponseBuilder( root, clientID, transID, "CanSetPark", 0, "" );    
    root["Value"] = canSetPark;
    //JsonArray& offsets = root.createNestedArray("Value");
    root.printTo(message);
    server.send(200, "text/json", message);
    return ;  
}

void handleCanSetShutterGet(void)
{
    String message;
    uint32_t clientID = (uint32_t)server.arg("ClientID").toInt();
    uint32_t transID = (uint32_t)server.arg("ClientTransactionID").toInt();
    DynamicJsonBuffer jsonBuffer(256);
    JsonObject& root = jsonBuffer.createObject();
    jsonResponseBuilder( root, clientID, transID, "CanSetShutter", 0, "" );    
    root["Value"] = canSetShutter;
    //JsonArray& offsets = root.createNestedArray("Value");
    root.printTo(message);
    server.send(200, "text/json", message);
    return ;  
}

void handleCanSlaveGet(void)
{
    String message;
    uint32_t clientID = (uint32_t)server.arg("ClientID").toInt();
    uint32_t transID = (uint32_t)server.arg("ClientTransactionID").toInt();
    DynamicJsonBuffer jsonBuffer(256);
    JsonObject& root = jsonBuffer.createObject();
    jsonResponseBuilder( root, clientID, transID, "CanSlave", 0, "" );    
    root["Value"] = canSlave;
    //JsonArray& offsets = root.createNestedArray("Value");
    root.printTo(message);
    server.send(200, "text/json", message);
    return ;  
}

void handleCanSyncAzimuthGet(void)
{
    String message;
    uint32_t clientID = (uint32_t)server.arg("ClientID").toInt();
    uint32_t transID = (uint32_t)server.arg("ClientTransactionID").toInt();
    DynamicJsonBuffer jsonBuffer(256);
    JsonObject& root = jsonBuffer.createObject();
    jsonResponseBuilder( root, clientID, transID, "CanSyncAzimuth", 0, "" );    
    root["Value"] = canSyncAzimuth;
    //JsonArray& offsets = root.createNestedArray("Value");
    root.printTo(message);
    server.send(200, "text/json", message);
    return ;  
}

//'Slaved' indicates a hardware link between the telescope and dome  - the ASCOM link is not the same. 
void handleSlavedGet(void)
{
    String message;
    uint32_t clientID = (uint32_t)server.arg("ClientID").toInt();
    uint32_t transID = (uint32_t)server.arg("ClientTransactionID").toInt();
    DynamicJsonBuffer jsonBuffer(256);
    JsonObject& root = jsonBuffer.createObject();
    jsonResponseBuilder( root, clientID, transID, "Slaved", 400, "Not Implemented" );    
    root["Value"] = slaved;
    //JsonArray& offsets = root.createNestedArray("Value");
    root.printTo(message);
    server.send(200, "text/json", message);
    return ;  
}

void handleSlavedPut(void)
{
    String message;
    uint32_t clientID = (uint32_t)server.arg("ClientID").toInt();
    uint32_t transID = (uint32_t)server.arg("ClientTransactionID").toInt();

    DynamicJsonBuffer jsonBuffer(256);
    JsonObject& root = jsonBuffer.createObject();
    jsonResponseBuilder( root, clientID, transID, "Slaved", 400, "Not Implemented" );    
    root["Value"] = false;
    //JsonArray& offsets = root.createNestedArray("Value");
    root.printTo(message);
    server.send(200, "text/json", message);
    return ;  
}

void handleSlewingGet(void)
{
    String message;
    uint32_t clientID = (uint32_t)server.arg("ClientID").toInt();
    uint32_t transID = (uint32_t)server.arg("ClientTransactionID").toInt();
    DynamicJsonBuffer jsonBuffer(256);
    JsonObject& root = jsonBuffer.createObject();
    jsonResponseBuilder( root, clientID, transID, "Slewing", 0, "" );    
    root["Value"] = ( domeStatus == DOME_SLEWING ) ? true:false;
    //JsonArray& offsets = root.createNestedArray("Value");
    root.printTo(message);
    server.send(200, "text/json", message);
    return ; 
}

void handleAbortSlewPut(void)
{
  String message;
  uint32_t clientID = (uint32_t)server.arg("ClientID").toInt();
  uint32_t transID = (uint32_t)server.arg("ClientTransactionID").toInt();
  DynamicJsonBuffer jsonBuffer(256);
    JsonObject& root = jsonBuffer.createObject();
   //in this driver model, each device has a separate ip address ,so can only be one device. hence ignore device-number
   if( domeStatus == DOME_SLEWING  )
    {
      //abort slew
      //Need to use shift not just add 
      addDomeCmd( clientID, transID, CMD_DOME_ABORT, 0 );
      jsonResponseBuilder( root, clientID, transID, "AbortSlew", 0, "" );
      abortFlag = true;
    }
    else
    {
      jsonResponseBuilder( root, clientID, transID, "AbortSlew", 400, "Not slewing" );       
    }
    //JsonArray& offsets = root.createNestedArray("Value");
    root.printTo(message);
    server.send(200, "text/json", message);
    return ;   
}

void handleShutterStatusGet(void)
{
  String message;
  uint32_t clientID = (uint32_t)server.arg("ClientID").toInt();
  uint32_t transID = (uint32_t)server.arg("ClientTransactionID").toInt();
  DynamicJsonBuffer jsonBuffer(256);
  JsonObject& root = jsonBuffer.createObject();
  //in this driver model, each device has a separate ip address ,so can only be one device. hence ignore device-number
  jsonResponseBuilder( root, clientID, transID, "ShutterStatus", 0, "" );
  root["Value"] = shutterStatus;

  //JsonArray& offsets = root.createNestedArray("Value");
  root.printTo(message);
  server.send(200, "text/json", message);
  return ;   
}

void handleCloseShutterPut(void)
{
  String message;
  uint32_t clientID = (uint32_t)server.arg("ClientID").toInt();
  uint32_t transID = (uint32_t)server.arg("ClientTransactionID").toInt();
  DynamicJsonBuffer jsonBuffer(256);
  JsonObject& root = jsonBuffer.createObject();
  //in this driver model, each device has a separate ip address ,so can only be one device. hence ignore device-number
  if( shutterStatus == SHUTTER_OPEN ) //&& shutter open detected == !shutterclosed)
  {
    jsonResponseBuilder( root, clientID, transID, "CloseShutter", 0, "" );
    //Create new async command
    addShutterCmd( clientID, transID, CMD_SHUTTER_CLOSE, 0 ); 
  }
  else
  {
    jsonResponseBuilder( root, clientID, transID, "CloseShutter", 400, "Shutter Not open or not idle" );       
  }
  //JsonArray& offsets = root.createNestedArray("Value");
  root.printTo(message);
  server.send(200, "text/json", message);
  return ;   
}

//Kick off the find home operation ???
void handleFindHomePut(void)
{
   String message;
   uint32_t clientID = (uint32_t)server.arg("ClientID").toInt();
   uint32_t transID = (uint32_t)server.arg("ClientTransactionID").toInt();
   DynamicJsonBuffer jsonBuffer(256);
   JsonObject& root = jsonBuffer.createObject();
   //in this driver model, each device has a separate ip address ,so can only be one device. hence ignore device-number
   if( domeStatus == DOME_IDLE )
    {
      //Set command to move to home.
      //cmdItem_t* pCmd = 
      addDomeCmd( clientID, transID, CMD_DOME_HOME, 0 ); 
      jsonResponseBuilder( root, clientID, transID, "FindHome", 0, server.arg("FindHome") );
    }
    else
    {
      jsonResponseBuilder( root, clientID, transID, "FindHome", 400, "Dome not idle" );       
    }
    root.printTo(message);
    server.send(200, "text/json", message);
    return ;   
}

void handleOpenShutterPut(void)
{
   String message;
   uint32_t clientID = (uint32_t)server.arg("ClientID").toInt();
   uint32_t transID = (uint32_t)server.arg("ClientTransactionID").toInt();
   DynamicJsonBuffer jsonBuffer(256);
   JsonObject& root = jsonBuffer.createObject();
   //in this driver model,each device has a separate ip address ,so can only be one device. hence ignore device-number
   if( shutterStatus != SHUTTER_OPEN && shutterStatus != SHUTTER_OPENING )
   {
      //Set command to open shutter.
      addShutterCmd( clientID, transID, CMD_SHUTTER_OPEN, 0 );
      jsonResponseBuilder( root, clientID, transID, "OpenShutter", 0, "" );    
   }
   else
   {
      jsonResponseBuilder( root, clientID, transID, "OpenShutter", 400, "Dome shutter not idle or not closed" );       
   }
   root.printTo(message);
   server.send( 200, "text/json", message);
   return ;   
}

//Set park operates when the dome is at the desired park position
void handleSetParkPut(void)
{
   String message;
   uint32_t clientID = (uint32_t)server.arg("ClientID").toInt();
   uint32_t transID = (uint32_t)server.arg("ClientTransactionID").toInt();
   int location = 0;
   DynamicJsonBuffer jsonBuffer(256);
   JsonObject& root = jsonBuffer.createObject();
   //in this driver model, each device has a separate ip address ,so can only be one device. hence ignore device-number
   if( domeStatus == DOME_IDLE && server.hasArg("location") )
    {
      //Set new park location.
      //...
      location = (int) server.arg("location").toInt();
      location %= 360;
      parkPosition = location;
      jsonResponseBuilder( root, clientID, transID, F("SetPark"), 0, "" );    
    }
   else
    {
      jsonResponseBuilder( root, clientID, transID, F("SetPark"), 400, F("Dome not idle") );       
    }
    root.printTo(message);
    server.send(200, "text/json", message);
    return ;      
}

//ParkPut causes the dome to move to the already stored Park position 
void handleParkPut(void)
{
   String message;
   uint32_t clientID = (uint32_t)server.arg("ClientID").toInt();
   uint32_t transID = (uint32_t)server.arg("ClientTransactionID").toInt();
   DynamicJsonBuffer jsonBuffer(256);
   JsonObject& root = jsonBuffer.createObject();
   //in this driver model, each device has a separate ip address ,so can only be one device. Hence ignore device-number
   if( domeStatus == DOME_IDLE )
    {
      addDomeCmd( clientID, transID, CMD_DOME_SLEW, parkPosition );      
      jsonResponseBuilder( root, clientID, transID, F("Park"), 0, "" );    
    }
   else
    {
      jsonResponseBuilder( root, clientID, transID, F("Park"), 400, F("Dome not idle, command queued") );       
    }
    root.printTo(message);
    server.send(200, "text/json", message);
    return ;      
}

void handleSlewToAltitudePut(void)
{
   String message;
   uint32_t clientID = (uint32_t)server.arg("ClientID").toInt();
   uint32_t transID = (uint32_t)server.arg("ClientTransactionID").toInt();
   int location = 0;
   DynamicJsonBuffer jsonBuffer(256);
   JsonObject& root = jsonBuffer.createObject();
   //in this driver model, each device has a separate ip address ,so can only be one device. hence ignore device-number
   if( domeStatus == DOME_IDLE && server.hasArg("altitude") )
    {
      //Set new shutter altitude.
      location = server.arg("altitude").toInt();
      location %= 110;
      //cmdItem_t* pCmd = domeCmdList->add( clientID, transID, CMD_DOMEVAR_SET, location );
      targetAltitude = location;
      jsonResponseBuilder( root, clientID, transID, F("SlewToAzimuth"), 0, "" );    
    }
   else
    {
      jsonResponseBuilder( root, clientID, transID, F("SlewToAzimuth"), 400, F("Dome not idle") );       
    }
    root.printTo(message);
    server.send(200, "text/json", message);
    return ;      
}

void handleSlewToAzimuthPut(void)
{
   String message;
   uint32_t clientID = (uint32_t)server.arg("ClientID").toInt();
   uint32_t transID = (uint32_t)server.arg("ClientTransactionID").toInt();
   int iTargetAzimuth = 0;
   DynamicJsonBuffer jsonBuffer(256);
   JsonObject& root = jsonBuffer.createObject();
   //in this driver model, each device has a separate ip address ,so can only be one device. hence ignore device-number
   if( domeStatus == DOME_IDLE && server.hasArg("Azimuth") )
    {
      //Set new park location.
      //...
      iTargetAzimuth = (int) server.arg("Azimuth").toInt();
      iTargetAzimuth %= 360;
      iTargetAzimuth += 360;
      iTargetAzimuth %= 360;
      targetAzimuth = (float) iTargetAzimuth;
      jsonResponseBuilder( root, clientID, transID, F("SlewToAzimuth"), 0, "" );    
    }
   else
    {
      jsonResponseBuilder( root, clientID, transID, "SlewToAzimuth", 400, "Dome not idle" );       
    }
    root.printTo(message);
    server.send(200, "text/json", message);
    return ;
}

