skybadger/ESP8266_AscomDome/ASCOM_DomeHandler.h
void handleSyncToAzimuthPut(void)
{
   String message;
   uint32_t clientID = (uint32_t)server.arg("ClientID").toInt();
   uint32_t transID = (uint32_t)server.arg("ClientTransactionID").toInt();
   int iTargetAzimuth = 0;
   float azimuthOffset = 0.0F;
   DynamicJsonBuffer jsonBuffer(256);
   JsonObject& root = jsonBuffer.createObject();
   //in this driver model, each device has a separate ip address ,so can only be one device. hence ignore device-number
   if( domeStatus == DOME_IDLE && server.hasArg("Azimuth") )
   {
      //Set new (actual) azimuth location.
      //...
      iTargetAzimuth = (int) server.arg( "Azimuth" ).toInt();
      iTargetAzimuth %= 360;
      iTargetAzimuth += 360;
      iTargetAzimuth %= 360;
            
      ///the offset is the difference between where the dome is currently pointing and where we are told it is pointing.
      azimuthOffset = (float) ( iTargetAzimuth - currentAzimuth );
      //Tell the dome to move to the target azimuth using the updated correction
      addDomeCmd( clientID, transID, CMD_DOME_SLEW, iTargetAzimuth );
      jsonResponseBuilder( root, clientID, transID, F("SyncToAzimuth"), 0, "" );    
   }
   else
   {
      jsonResponseBuilder( root, clientID, transID, "SyncToAzimuth", 400, "Dome not idle" );       
    }
    root.printTo(message);
    server.send(200, F("text/json"), message);
    return ;
}

  /* Handle the command list - we've already checked we are idle at this point.
   */
  void onDomeIdle( void )
  {
    cmdItem_t* pCmd = nullptr;
    
    if ( domeCmdList->size() > 0 ) 
    {
      pCmd = domeCmdList->pop();
  
      switch ( pCmd->cmd )
      {
        case CMD_DOME_SLEW:
          domeStatus = DOME_SLEWING;
          onDomeSlew();
          break;
        case CMD_DOME_ABORT:
          onDomeAbort();
          break;
        case CMD_DOMEVAR_SET:
          //Did this so that dome variables aren't updated while waiting for commands that preceeded them to execute.    
          default:
        break;
      }
    }  
    return;
  }

  /* 
   *  Not to query rotating shutter but to include offsets in returned result. 
   */  
  float getAzimuth( float value )
  {
    value = ( value + azimuthSyncOffset );
    if ( value < 0.0F ) 
    {
      value += 360.0;      
    }
    else if (value > 360.0F )
      value -= 360.0F;

    return value;
  }
  
  /*
   * Handle dome rotation slew speeds and directions 
   * slow to crawl once near target azimuth
   * Calc minimum distance to select direction
   */
  void onDomeSlew( void )
  {
    int distance = 0;
    enum motorSpeed speed = MOTOR_SPEED_OFF;
    enum motorDirection direction = MOTOR_DIRN_CW;
    
    int localAzimuth = 0; 
    
    if( domeStatus != DOME_SLEWING )
      return;

    localAzimuth = getAzimuth( bearing );
    distance = targetAzimuth - localAzimuth ;
    distance %= 360;
    
    //Work out speed to turn dome
    if( abs(distance) < acceptableAzimuthError )
    {
      //Stop!!
      //turn off motor
      myMotor.setSpeedDirection( speed = MOTOR_SPEED_OFF, direction );
      domeStatus = DOME_IDLE;
      if( abs( localAzimuth - homePosition ) < acceptableAzimuthError )
        atHome = true;
      DEBUGSL1( "Dome stopped at target");
      //myLCD.write( 2, 0, "Dome halted at target." );
    }
    else if ( abs(distance < slowAzimuthRange ) )   
    {
      speed = MOTOR_SPEED_SLOW_SLEW;
      DEBUGS1( "Dome target distance: ");
      DEBUGSL1( distance );
      DEBUGSL1( "Dome speed set to slow slew");
    }
    else
    {
      speed = MOTOR_SPEED_FAST_SLEW;
      DEBUGS1( "Dome target distance: ");
      DEBUGSL1( distance );
      DEBUGSL1( "Dome speed set to fast slew");    
    }
    
    //Work out the direction. 
    direction = ( distance > 0 ) ? MOTOR_DIRN_CW: MOTOR_DIRN_CCW;
    if ( abs( distance ) > 180 )
    {
      DEBUGS1( "Dome target distance: ");
      DEBUGSL1( distance );

      //Swap direction and go the short route. 
      if( direction == MOTOR_DIRN_CW)
      {
         direction = MOTOR_DIRN_CCW;
          DEBUGSL1( "Dome direction reversed to CCW");         
      }
      else
      {
        direction = MOTOR_DIRN_CW;
          DEBUGSL1( "Dome direction reversed to CW");               
      }
    }
        
    myMotor.setSpeedDirection( speed, direction );
    return;
   }
  
 void updateCmdResponseList( int shutterStatus )
 {
    //TODO - check list for status enum and update list to show complete
    //Idea is that if we have a client come back to check, we answer. 
    //In practise client polls status so may drop this. 
    return;    
 }
  
  /*
   * Handler for domeAbort command
   */ 
  void onDomeAbort( void )
  {
    //clear down command list
    domeCmdList->clear();//TODO memory error- needs to delete all mallocs properly.
    //turn off motor
    myMotor.setSpeedDirection( MOTOR_SPEED_OFF, MOTOR_DIRN_CW );
    //message to LCD  
    myLCD.writeLCD( 2, 0, "ABORT received - dome halted." );
    // ? close shutter ?
    return;
  }

  void onShutterIdle()
  {
    String response = "";
    //Get next command if there is one. 

    cmdItem_t* pCmd = nullptr;
    if ( shutterCmdList->size() > 0 ) 
      pCmd = shutterCmdList->pop();
    
    String uri = "http://";
    uri.concat( sensorHostname);
    uri.concat("/shutter");
    
    switch ( pCmd->cmd )
    {
       case CMD_SHUTTER_OPEN: 
       case CMD_SHUTTER_CLOSE: 
          onShutterSlew();
          break;
       case CMD_SHUTTER_ABORT:
          restQuery( uri, "status=abort", response, HTTP_PUT);
          myLCD.writeLCD( 2, 0, "DSH ABORT" );
          break;
       case CMD_SHUTTERVAR_SET:
       default:
        break;
    }
  }
  
  /* Function to hande shutter slew command. 
     Uses rest aPi to talk to shutter controller on rotating dome section
     Could instead be the roll off roof controller but you might build that into this, non-rotating controller instead.  
   */
  void onShutterSlew()
  {
    //check shutter state
    int currentShutterStatus = SHUTTER_ERROR;
    String outbuf;
    String uri = "http://";
    int response = 0;
    DynamicJsonBuffer jsonBuff(256);

