skybadger/ESP8266_AscomDome/ASCOM_DomeHandler.h
    uri.concat( shutterHostname );
    uri.concat( "/shutter" );
    response = restQuery( uri, "" , outbuf, HTTP_GET );
    JsonObject& root = jsonBuff.parse( outbuf );
    
    if ( response == 200 && root.success() && root.containsKey( "status" ) )
      currentShutterStatus = root["status"];

    switch ( currentShutterStatus )
    {
      case SHUTTER_OPENING:
      if ( currentShutterStatus == SHUTTER_OPEN  )
      {
        shutterStatus = SHUTTER_OPEN;
        //Should now update command response list...
        updateCmdResponseList( shutterStatus );
      }
        break;
      case SHUTTER_CLOSING:
      if ( currentShutterStatus == SHUTTER_CLOSED  )
      {
        shutterStatus = SHUTTER_CLOSED;
        //Should now update command response list...
        updateCmdResponseList( shutterStatus );
      }
        break;
      
      // do nothing for these - they are static, unless they have unexpectedly changed
      case SHUTTER_OPEN:
      if( currentShutterStatus != SHUTTER_OPEN )
        shutterStatus = SHUTTER_ERROR;
        //What are we going to do about it ?
      case SHUTTER_CLOSED:
      if( currentShutterStatus != SHUTTER_CLOSED )
      {
        shutterStatus = SHUTTER_ERROR;
        //Should now update command response list...
        updateCmdResponseList( shutterStatus );        
      }
      case SHUTTER_ERROR:  //bad state
        //What are we going to do about it ?
        //Alert
        //Send email 
        //etc
        break;
      default:
        break;
    }  
  }

  void onShutterAbort( void )
  {
    String outbuf = "";
    String uri = "http:";
    shutterCmdList->clear();
    uri.concat( sensorHostname );
    uri.concat("/shutter");
    if( restQuery( uri, "status=abort", outbuf ,HTTP_PUT) != HTTP_CODE_OK)
    {
      //what to do ?
    }
    // updateCmdResponseList( shutterStatus );        
  } 
  
  void setupEncoder()
  {
    //TODO 
    return;
  }
 
  //Detect compass service and initialise azimuth bearing of dome
  bool setupCompass( String targetHost )
  {
    bool status = false;
    String compassURL = "http://";
    String output = "";
    int response = 0;
    float value;
    DynamicJsonBuffer jsonBuff(256);
    
    compassURL.concat( sensorHostname );
    compassURL.concat( "/bearing" );
    response = restQuery( compassURL, "", output, HTTP_GET );
    DEBUG_HTTPCLIENT( "[HTTPClient response ]  rsponse code: %i, response: %s\n", response, output.c_str() );
    JsonObject& root = jsonBuff.parse( output );
    
    if ( response == HTTP_CODE_OK && root.success() && root.containsKey("bearing") )
    {
      value = (float) root.get<float>("bearing"); //initialise current setting
      status = true;
    }
    else
    {
      Serial.print( "Shutter compass bearing call not successful, response: " );    Serial.println( response );
      Serial.print( "JSON parsing status: " );    Serial.println( root.success() );
    }
    return status;
  }

  /*
   * Query a url for a parsed json output
   * check return code with object.success();
   */ 
  int restQuery( String uri, String args, String& response, int method )
  {
    int httpCode = 0;
    long int startTime;
    long int endTime;
    HTTPClient hClient;
    hClient.setTimeout ( (uint16_t) 250 );    
    hClient.setReuse( false );    
    
    DEBUG_HTTPCLIENT("restQuery request [%i] uri: %s args:%s\n", method, uri.c_str(), args.c_str() );
    startTime = millis();
    if ( hClient.begin( wClient, uri ) ) //uri must already have request args in it
    {
      if( method == HTTP_GET )
      {
        httpCode = hClient.GET();
        endTime = millis();
        DEBUG_HTTPCLIENT( "Time for restQuery call(mS): %li\n", endTime-startTime );
      }
      else if ( method == HTTP_PUT ) //variables are added as headers
      {
        httpCode = hClient.PUT( args );        
        endTime = millis();
        DEBUG_HTTPCLIENT("Time for restQuery call: %li mS\n", endTime-startTime );
      }
     
      // file found at server ?
      if (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY) 
      {
        response = hClient.getString();
        DEBUG_HTTPCLIENT("Response: %s\n", response.c_str() );
      }
      else 
      {
        DEBUG_HTTPCLIENT("restQuery ... failed, error: %s\n", hClient.errorToString(httpCode).c_str() );
        ;;
      } 
      hClient.end();
    }
    else
    {
       DEBUG_HTTPCLIENT("restQuery Unable to open connection");
    }  
    return httpCode;
  }
  
  /*
   * Function to determine bearing of dome - just return a sane value to the caller. Let the caller handler sync offsets. 
   */
  float getBearing( String host)
  {
    static int bearingRepeatCount = 0;
    static float lastBearing = 0.0F;
    const int bearingRepeatLimit = 10;
    float bearing = 0.0F;
    int response = 0;
    String outbuf = "";
    DynamicJsonBuffer jsonBuff(256);    
    
    //Update the bearing
    String uri = "http://";
    uri.concat( host );
    uri.concat( "/bearing" );    
    response = restQuery( uri, "", outbuf, HTTP_GET );
    DEBUG_HTTPCLIENT("GetBearing response code: %i, response: %s\n", response, outbuf.c_str() );
    JsonObject& root = jsonBuff.parse( outbuf );
    
    if ( response == HTTP_CODE_OK && root.success() && root.containsKey( "bearing" ) )
    {
      DEBUG_HTTPCLIENT(" GetBearing: successful: %f \n", bearing );
      bearing = (float) root.get<float>("bearing");
      if( bearing >= 0.0F && bearing <= 360.0F )
        currentAzimuth = bearing;
      if ( lastBearing == bearing ) //We do this to check for sensor freeze
      {
        bearingRepeatCount ++;
        DEBUG_HTTPCLIENT(" GetBearing: Sensor stuck %i detected @ %f\n", bearingRepeatCount, bearing );
        
        //reset the compass by resetting the target device
        if ( bearingRepeatCount > bearingRepeatLimit ) 
        {  
          uri = "http://";
          uri.concat( sensorHostname );
          uri.concat( "/bearing/reset" );
          
          response = restQuery( uri, "", outbuf, HTTP_PUT );
          DEBUG_HTTPCLIENT(" GetBearing: Compass reset attempted !");
          myLCD.writeLCD( 2, 0, "Compass reset !");
          bearingRepeatCount = 0;
        }
      }
      else //good value not stuck 
      {
        DEBUG_HTTPCLIENT(" GetBearing: Reading obtained %f\n", bearing );
        lastBearing = bearing;
        bearingRepeatCount = 0;
      }
    }
    else //can't retrieve the bearing
    {
      //hand back the current bearing, so we don;t slew off into strange territory when we return 0.0f instead. 
      DEBUG_HTTPCLIENT("GetBearing: no reading, using last  ");
      bearing = currentAzimuth - azimuthSyncOffset;
    }
    return bearing;
  }
  
  /*
   * Rest call to retrieve shutter Status. 
   */ 
  int getShutterStatus( String host )
  {
    String outbuf;
    int value = 0;
    DynamicJsonBuffer jsonBuff(256);

    String uri = String( "http://" );
    uri.concat( host );
    uri.concat( "/shutter" );
    int response = restQuery( uri , "", outbuf, HTTP_GET  );
    JsonObject& root = jsonBuff.parse( outbuf ); 
    if ( response == 200 && root.success() && root.containsKey("status") )
    {
      value = ( enum shutterState) root.get<int>("status");    
    }
    else
    {
      value = SHUTTER_ERROR;
      DEBUG_HTTPCLIENT("Shutter controller call not successful, response: %i\n", response );
      DEBUG_HTTPCLIENT("Shutter JSON parsing status: %i\n", root.success() );
    }
  return value;
  }
#endif
